Revit 2016 API
WallFoundation.FootingType Property
Retrieves an object that represents the type of the footing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use WallFoundation.GetFoundationType() or WallFoundation.SetFoundationType() methods instead.")]
public WallFoundationType FootingType { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use WallFoundation.GetFoundationType() or WallFoundation.SetFoundationType() methods instead.")> _
Public Property FootingType As WallFoundationType
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use WallFoundation.GetFoundationType() or WallFoundation.SetFoundationType() methods instead.")]
public:
property WallFoundationType^ FootingType {
	WallFoundationType^ get ();
	void set (WallFoundationType^ value);
}
Remarks
The footing type can be used to access the multi layered structure of a footing.
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace